In [1]:
import pandas as pd

In [11]:
from sklearn.model_selection import train_test_split

In [7]:
df = pd.read_csv('dubai_properties.csv',encoding= 'utf-8')

In [8]:
df.head()

,Address,Rent,Beds,Baths,Type,Area_in_sqft,Rent_per_sqft,Rent_category,Frequency,Furnishing,Purpose,Posted_date,Age_of_listing_in_days,Location,City,Latitude,Longitude
0,"The Gate Tower 2, The Gate Tower, Shams Gate D...",124000,3,4,Apartment,1785,69.467787,Medium,Yearly,Unfurnished,For Rent,2024-03-07,45,Al Reem Island,Abu Dhabi,24.493598,54.407841
1,"Water's Edge, Yas Island, Abu Dhabi",140000,3,4,Apartment,1422,98.452883,Medium,Yearly,Unfurnished,For Rent,2024-03-08,44,Yas Island,Abu Dhabi,24.494022,54.607372
2,"Al Raha Lofts, Al Raha Beach, Abu Dhabi",99000,2,3,Apartment,1314,75.342466,Medium,Yearly,Furnished,For Rent,2024-03-21,31,Al Raha Beach,Abu Dhabi,24.485931,54.600939
3,"Marina Heights, Marina Square, Al Reem Island,...",220000,3,4,Penthouse,3843,57.246942,High,Yearly,Unfurnished,For Rent,2024-02-24,57,Al Reem Island,Abu Dhabi,24.493598,54.407841
4,"West Yas, Yas Island, Abu Dhabi",350000,5,7,Villa,6860,51.020408,High,Yearly,Unfurnished,For Rent,2024-02-16,65,Yas Island,Abu Dhabi,24.494022,54.607372

In [9]:
df.describe()

,Rent,Beds,Baths,Area_in_sqft,Rent_per_sqft,Age_of_listing_in_days,Latitude,Longitude
count,7.374200e+04,73742.000000,73742.000000,73742.000000,73742.000000,73742.000000,73023.000000,73023.000000
mean,1.479250e+05,2.162811,2.650213,2054.053552,88.057754,74.261547,24.918929,55.053133
std,3.069658e+05,1.578155,1.632997,3003.919252,66.534400,72.346767,0.569356,0.653722
min,0.000000e+00,0.000000,1.000000,74.000000,0.000000,11.000000,15.175847,43.351928
25%,5.499900e+04,1.000000,2.000000,850.000000,39.977778,30.000000,24.493598,54.607372
50%,9.800000e+04,2.000000,2.000000,1334.000000,71.428571,52.000000,25.078641,55.238209
75%,1.700000e+05,3.000000,3.000000,2130.000000,118.483412,95.000000,25.197978,55.367138
max,5.500000e+07,12.000000,11.000000,210254.000000,2182.044888,2276.000000,25.920310,56.361294

In [10]:
df.shape

(73742, 17)

In [14]:
X = df[["Beds", "Area_in_sqft", "Baths"]]
y = df["Rent"]

In [15]:
X.head()

   Beds  Area_in_sqft  Baths
0     3          1785      4
1     3          1422      4
2     2          1314      3
3     3          3843      4
4     5          6860      7

In [16]:
y.head()

0    124000
1    140000
2     99000
3    220000
4    350000
Name: Rent, dtype: int64

In [17]:
X_train , X_test , y_train , y_test = train_test_split(X , y , random_state=45 , test_size=0.2)

In [19]:
X_train.shape

(58993, 3)

In [21]:
X_test.shape

(14749, 3)

In [22]:
y_train.shape

(58993,)

In [23]:
y_test.shape

(14749,)

In [24]:
X_train.head()

       Beds  Area_in_sqft  Baths
7554      2          1399      3
55001     0           406      2
20691     0           590      1
30243     2          2168      2
18506     2          1600      3

In [26]:
X_train.describe()

               Beds   Area_in_sqft         Baths
count  58993.000000   58993.000000  58993.000000
mean       2.161426    2049.298612      2.649687
std        1.579067    2871.311273      1.634552
min        0.000000      74.000000      1.000000
25%        1.000000     850.000000      2.000000
50%        2.000000    1332.000000      2.000000
75%        3.000000    2142.000000      3.000000
max       12.000000  173565.000000     11.000000

In [27]:
X_test.describe()

               Beds   Area_in_sqft         Baths
count  14749.000000   14749.000000  14749.000000
mean       2.168350    2073.072344      2.652315
std        1.574542    3484.264676      1.626817
min        0.000000      74.000000      1.000000
25%        1.000000     850.000000      2.000000
50%        2.000000    1337.000000      2.000000
75%        3.000000    2100.000000      3.000000
max       11.000000  210254.000000     11.000000

In [29]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [42]:
X1=df[["Beds","Baths","Area_in_sqft","Rent_per_sqft","Age_of_listing_in_days"]]
cols = X1.columns

In [36]:
scaler=StandardScaler()
X1_standard=scaler.fit_transform(X1)

In [44]:
X1_standard=pd.DataFrame(X1_standard,columns=cols)
X1_standard.head()

       Beds     Baths  Area_in_sqft  Rent_per_sqft  Age_of_listing_in_days
0  0.530490  0.826576     -0.089568      -0.279406               -0.404465
1  0.530490  0.826576     -0.210411       0.156238               -0.418288
2 -0.103166  0.214201     -0.246364      -0.191110               -0.597979
3  0.530490  0.826576      0.595542      -0.463084               -0.238596
4  1.797801  2.663702      1.599903      -0.556668               -0.128017

In [46]:
X1_standard.describe().round(3)

,Beds,Baths,Area_in_sqft,Rent_per_sqft,Age_of_listing_in_days
count,73742.000,73742.000,73742.000,73742.000,73742.000
mean,-0.000,0.000,0.000,0.000,0.000
std,1.000,1.000,1.000,1.000,1.000
min,-1.370,-1.011,-0.659,-1.324,-0.874
25%,-0.737,-0.398,-0.401,-0.723,-0.612
50%,-0.103,-0.398,-0.240,-0.250,-0.308
75%,0.530,0.214,0.025,0.457,0.287
max,6.233,5.113,69.310,31.472,30.433

In [51]:
min_max_scaler=MinMaxScaler(feature_range=(0,1))
X1_normalaize=min_max_scaler.fit_transform(X1)
X1_normalaize=pd.DataFrame(X1_normalaize,columns=cols)

In [52]:
X1_normalaize.head()

       Beds  Baths  Area_in_sqft  Rent_per_sqft  Age_of_listing_in_days
0  0.250000    0.3      0.008141       0.031836                0.015011
1  0.250000    0.3      0.006414       0.045120                0.014570
2  0.166667    0.2      0.005900       0.034528                0.008830
3  0.250000    0.3      0.017932       0.026235                0.020309
4  0.416667    0.6      0.032287       0.023382                0.023841

In [53]:
X1_normalaize.describe().round(3)

,Beds,Baths,Area_in_sqft,Rent_per_sqft,Age_of_listing_in_days
count,73742.000,73742.000,73742.000,73742.000,73742.000
mean,0.180,0.165,0.009,0.040,0.028
std,0.132,0.163,0.014,0.030,0.032
min,0.000,0.000,0.000,0.000,0.000
25%,0.083,0.100,0.004,0.018,0.008
50%,0.167,0.100,0.006,0.033,0.018
75%,0.250,0.200,0.010,0.054,0.037
max,1.000,1.000,1.000,1.000,1.000